#튜플

print("튜플생성하기=======================================")
t = (1,2,3)

print(t, type(t))

print("튜플값 사용하기=======================================")
t = (1,2,"python")
print(t, type(t))

print(t[0], t[1], t[2], t[-1], t[-2])
print(t[1:3])
print(t[:])

print("튜플의 연결 확장=======================================")
ttt = t*3
print(ttt)
print(t)

print(len(t))

print(20000 in t)

print("튜플의 값 변경(x)=======================================")

t = ('apple', 'banana', 10, 20)
#t[0] = "mango" #변경 불가능
#t[2] = t[2] + 90 #변경 불가능

print(t[2]+90)

t[1:2] = (1000, 2000)
print(t)